4) /home/can/code/guessong/app/Http/Controllers/Auth/LoginController.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return RedirectResponse
      */
-    public function redirectToProvider($provider) : RedirectResponse
+    protected function redirectToProvider($provider) : RedirectResponse
     {
         return \Socialite::driver($provider)->scopes(SocialiteScopes::$provider())->redirect();
     }

5) /home/can/code/guessong/app/Http/Controllers/Auth/LoginController.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return RedirectResponse
      */
-    public function handleProviderCallback($provider) : RedirectResponse
+    protected function handleProviderCallback($provider) : RedirectResponse
     {
         $user = \Socialite::driver($provider)->user();
         $authUser = $this->findOrCreateUser($user, $provider);

6) /home/can/code/guessong/app/Http/Controllers/Auth/LoginController.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = \Socialite::driver($provider)->user();
         $authUser = $this->findOrCreateUser($user, $provider);
-        \Auth::login($authUser, true);
+        
         return redirect($this->redirectTo);
     }
     /**

7) /home/can/code/guessong/app/Http/Controllers/Auth/LoginController.php:67    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $user = \Socialite::driver($provider)->user();
         $authUser = $this->findOrCreateUser($user, $provider);
-        \Auth::login($authUser, true);
+        \Auth::login($authUser, false);
         return redirect($this->redirectTo);
     }
     /**

8) /home/can/code/guessong/app/Http/Controllers/Auth/LoginController.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return User
      */
-    public function findOrCreateUser($user, $provider) : User
+    protected function findOrCreateUser($user, $provider) : User
     {
         $authUser = User::firstOrCreate(['email' => $user->email], ['name' => $user->name]);
         $socialProfile = $authUser->socialLogin ?: new SocialLogin();
