27) /home/can/code/guessong/app/Services/Spotify.php:160    [M] Throw_

--- Original
+++ New
@@ @@
                 // Retry
                 return $callback();
             }
-            throw $e;
+            $e;
         }
         return $return;
     }
 }
